In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series (np.arange(5),index = np.arange(5)[::-1], dtype='int64')
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [3]:
s.isin([1,3,4])

4    False
3     True
2    False
1     True
0     True
dtype: bool

In [4]:
s[s.isin([1,3,4])]

3    1
1    3
0    4
dtype: int64

In [9]:
s2 = pd.Series(np.arange(6), index = pd.MultiIndex.from_product([[0,1],[' a ', 'b ','c ']]))
s2

0   a     0
   b      1
   c      2
1   a     3
   b      4
   c      5
dtype: int32

In [10]:
s2.iloc[s2.index.isin([(1,'a'),(0,'b')])]

Series([], dtype: int32)

In [14]:
dates = pd.date_range('20171124', periods = 8)

df = pd.DataFrame (np. random.randn(8,4), index=dates,columns=['A', 'B', ' C' , ' D'])
df

                   A         B         C         D
2017-11-24  0.756852  1.221741 -0.999877  1.793315
2017-11-25  1.136204  1.029524 -0.875915  1.236340
2017-11-26  0.316441 -0.148887  0.313994  0.581076
2017-11-27  0.732921 -2.238494 -1.157159 -1.069529
2017-11-28 -1.192360  0.471364  0.509348  0.248141
2017-11-29  1.507789  1.315115  0.138608  1.629657
2017-11-30 -0.225896 -0.372015 -0.020706 -1.265433
2017-12-01  2.882004 -0.679234 -0.475420 -2.121290

In [15]:
df.select(lambda x:x=='A',axis = 'columns')

AttributeError: 'DataFrame' object has no attribute 'select'

In [16]:
df.where(df<0)

                   A         B         C         D
2017-11-24       NaN       NaN -0.999877       NaN
2017-11-25       NaN       NaN -0.875915       NaN
2017-11-26       NaN -0.148887       NaN       NaN
2017-11-27       NaN -2.238494 -1.157159 -1.069529
2017-11-28 -1.192360       NaN       NaN       NaN
2017-11-29       NaN       NaN       NaN       NaN
2017-11-30 -0.225896 -0.372015 -0.020706 -1.265433
2017-12-01       NaN -0.679234 -0.475420 -2.121290

In [17]:
df.where(df<0,-df)#大于0的给它加个负号

                   A         B         C         D
2017-11-24 -0.756852 -1.221741 -0.999877 -1.793315
2017-11-25 -1.136204 -1.029524 -0.875915 -1.236340
2017-11-26 -0.316441 -0.148887 -0.313994 -0.581076
2017-11-27 -0.732921 -2.238494 -1.157159 -1.069529
2017-11-28 -1.192360 -0.471364 -0.509348 -0.248141
2017-11-29 -1.507789 -1.315115 -0.138608 -1.629657
2017-11-30 -0.225896 -0.372015 -0.020706 -1.265433
2017-12-01 -2.882004 -0.679234 -0.475420 -2.121290

In [20]:
df = pd.DataFrame(np.random.randn(10,3),columns=list('ABC'))
df

          A         B         C
0  0.425285  2.581008  1.109709
1 -0.198788 -0.517609 -1.185440
2 -1.239160 -1.252369  1.621535
3  0.461692  0.229831  0.586663
4  0.495504 -0.871963  1.358766
5  1.355714  0.982908  1.051260
6  0.331157 -0.164900  0.026636
7 -0.544654  0.631161 -0.097561
8 -0.179410 -0.363474  0.316914
9 -1.170616 -0.002146  1.958608

In [23]:
df.query('A<B')

          A         B         C
0  0.425285  2.581008  1.109709
7 -0.544654  0.631161 -0.097561
9 -1.170616 -0.002146  1.958608